---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCOpeningData.IsRecess
source: html/29b63130-f863-016e-6a29-4c2a514474ee.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData.IsRecess Property

Trus if it is a recess, false if it is an opening.

## Syntax (C#)
```csharp
public bool IsRecess { get; }
```